# -*- coding: utf-8 -*-
# 请不要删掉上面这行！！！

# ICE_GAME 起床战争（经验模式）配置文档
# v1.1
# 新增 大厅等待人数
# ################################

# 全局坐标设置
# 等候大厅的坐标
lobbyPos = (0, 242, 0)
# 玩家淘汰后的重生位置
spectatorPos = (0, 109, 0)
# 多少人后会开始倒计时？
startCountdown = 4
# 多少人后会缩短倒计时
enoughPlayers = 16

# 队伍设置
# 使用数字index

# 设置队名（将在各种信息中显示）
teamNames = {
    1: '§g§l黄队§r',
    2: '§9§l蓝队§r',
}

# 羊毛颜色
colorData = {
    1: 4,
    2: 3
}

# 队伍简称（出现在玩家头顶)
teamPrefix = {
    1: '§g§lT§r',
    2: '§9§lC§r'
}

# 总队伍数量
teamsCount = 2

# 队伍出生点
pos = {
    1: (90, 101, 0),
    2: (-90, 101, 0)
}

# 队伍床坐标
bedPos = {
    1: (98, 96, 0),
    2: (-98, 96, 0)
}

# 床的偏移坐标（每个床占两个坐标）
bedPosD = {
    1: (99, 96, 0),
    2: (-99, 96, 0)
}

# 资源点坐标
resPos = {
    # 坐标用逗号间隔，不要去掉中括号！！！
    'iron': [(99, 101, -6), (100, 101, -6), (-99, 101, -6), (-100, 101, -6)],
    'gold': [(99, 101, 6), (100, 101, 6), (-99, 101, 6), (-100, 101, 6)],
    'diamond': [(0, 100, -44), (0, 101, 50)],
    'emerald': [(0, 101, 0), (0, 109, 0)]
}

# 商店NPC坐标
shopPos = {
    # 跟上面的格式一样
    # 物品商店
    'items': [(105, 101, 1), (105, 101, -1), (-105, 101, 1), (-105, 101, -1)],
    # 队伍升级商店
    'upgrades': [(80, 66, -6), (6, 66, 80),(-6, 66, -80),(-80, 66, 6)]
}

# 不同物品的价值（经验模式）
resValue = {
    'iron_ingot': 5,
    'gold_ingot': 100,
    'diamond': 500,
    'emerald': 1000
}

# =====================================================================
# 反装压设置
# 各种盔甲需要多长时间的计时？（名称需要和bwsScript.consts匹配）
armorTimers = {
    'iron': 420,
    'diamond_half': 360,
    'diamond': 175
}

# =============================常量定义区域，请勿修改=================================
bedHeading = {
    1: 1,
    2: 3
}
