# -*- coding: utf-8 -*-
# 请不要删掉上面这行！！！

# ICE_GAME 起床战争（经验模式）配置文档
# v1.1
# 新增 大厅等待人数
# ################################

# 全局坐标设置
# 等候大厅的坐标
lobbyPos = (0, 242, 0)
# 玩家淘汰后的重生位置
spectatorPos = (0, 100, 0)
# 多少人后会开始倒计时？
startCountdown = 2
# 多少人后会缩短倒计时
enoughPlayers = 16

# 队伍设置
# 使用数字index，1234分别为红黄蓝绿

# 设置队名（将在各种信息中显示）
teamNames = {
    1: '§c§l红队§r',
    2: '§e§l黄队§r',
    3: '§b§l蓝队§r',
    4: '§a§l绿队§r'
}

# 羊毛颜色
colorData = {
    1: 14,
    2: 4,
    3: 3,
    4: 5
}

# 队伍简称（出现在玩家头顶)
teamPrefix = {
    1: '§c§lR§r',
    2: '§e§lY§r',
    3: '§b§lB§r',
    4: '§a§lG§r'
}

# 总队伍数量
teamsCount = 4

# 队伍出生点
pos = {
    1: (79, 66, 0), #red team
    2: (0, 66, -79), #yellow team
    3: (-79, 66, 0), #blue team
    4: (0, 66, 79) #green team
}

# 队伍床坐标
bedPos = {
    1: (66, 67, 0),
    2: (0, 67, -66),
    3: (-66, 67, 0),
    4: (0, 67, 66)
}

# 床的偏移坐标（每个床占两个坐标）
bedPosD = {
    1: (67, 67, 0),
    2: (0, 67, -67),
    3: (-67, 67, 0),
    4: (0, 67, 67)
}

# 资源点坐标
resPos = {
    # 坐标用逗号间隔，不要去掉中括号！！！
    'iron': [(82, 66, 0), (-82, 66, 0),(0, 66, 82),(0, 66, -82)],
    'gold': [(82, 66, 0), (-82, 66, 0),(0, 66, 82),(0, 66, -82)],
    'diamond': [(31, 67, 29), (31, 67, -29),(-29, 67, 31),(-29, 67, -31)],
    'emerald': [(8, 71, 12), (-7, 71, -11)]
}

# 商店NPC坐标
shopPos = {
    # 跟上面的格式一样
    # 物品商店
    'items': [(80, 66, 6), (-6, 66, 80),(6, 66, -80),(-80, 66, -6)],
    # 队伍升级商店
    'upgrades': [(80, 66, -6), (6, 66, 80),(-6, 66, -80),(-80, 66, 6)]
}

# 不同物品的价值（经验模式）
resValue = {
    'iron_ingot': 5,
    'gold_ingot': 100,
    'diamond': 500,
    'emerald': 1000
}

# =====================================================================
# 反装压设置
# 各种盔甲需要多长时间的计时？（名称需要和bwsScript.consts匹配）
armorTimers = {
    'iron': 420,
    'diamond_half': 360,
    'diamond': 175
}

# =============================常量定义区域，请勿修改=================================
bedHeading = {
    1: 1,
    2: 4,
    3: 3,
    4: 2
}
