# -*- coding: utf-8 -*-
# 请不要删掉上面这行！！！

# ICE_GAME 起床战争（经验模式）配置文档
# v1.1
# 新增 大厅等待人数
# ################################

# 全局坐标设置
# 等候大厅的坐标
lobbyPos = (-87, 161, 91)
# 玩家淘汰后的重生位置
spectatorPos = (-87, 25, 91)
# 多少人后会开始倒计时？
startCountdown = 2
# 多少人后会缩短倒计时
enoughPlayers = 8

# 队伍设置
# 使用数字index，12345678分别为红蓝绿黄青白粉灰

# 设置队名（将在各种信息中显示）
teamNames = {
    1: '§c§l红队§r',
    2: '§1§l蓝队§r',
    3: '§a§l绿队§r',
    4: '§e§l黄队§r',
    5: '§b§l青队§r',
    6: '§f§l白队§r',
    7: '§d§l紫队§r',
    8: '§g§l橙队§r',
}

# 羊毛颜色
colorData = {
    1: 14,
    2: 3,
    3: 5,
    4: 4,
    5: 9,
    6: 0,
    7: 10,
    8: 1
}

# 队伍简称（出现在玩家头顶)
teamPrefix = {
    1: '§c§lR§r',
    2: '§1§lB§r',
    3: '§a§lG§r',
    4: '§e§lY§r',
    5: '§b§lA§r',
    6: '§f§lW§r',
    7: '§d§lP§r',
    8: '§g§lO§r'
}

# 总队伍数量
teamsCount = 8

# 队伍出生点
pos = {
    1: (-118, 24,169), #red team
    2: (-9, 24, 60), #blue team
    3: (-56, 24, 13), #green team
    4: (-165, 24, 60), #yellow team
    5: (-9, 24, 122), #aqua team
    6: (-165, 24, 122), #white team
    7: (-56, 24, 169), #purple team
    8: (-118, 24, 13), #orange team
}

# 队伍床坐标
bedPos = {
    1: (-118, 24, 160),
    2: (-18, 24, 60),
    3: (-56, 24, 22),
    4: (-156, 24, 60),
    5: (-18, 24, 122),
    6: (-156, 24, 122),
    7: (-56, 24, 160),
    8: (-156, 24, 60)
}

# 床的偏移坐标（每个床占两个坐标）
bedPosD = {
    1: (-118, 24, 159),
    2: (-19, 24, 60),
    3: (-56, 24, 23),
    4: (-155, 24, 60),
    5: (-19, 24, 122),
    6: (-155, 24, 122),
    7: (-56, 24, 159),
    8: (-155, 24, 60)
}

# 资源点坐标
resPos = {
    # 坐标用逗号间隔，不要去掉中括号！！！
    'iron': [(-118, 23, 7), (-56, 23, 7),(-3, 23, 60),(-3, 23, 122),(-56, 23, 175),(-118, 23, 175),(-171, 23, 122),(-171, 23, 60)],
    'gold': [(-118, 23, 7), (-56, 23, 7),(-3, 23, 60),(-3, 23, 122),(-56, 23, 175),(-118, 23, 175),(-171, 23, 122),(-171, 23, 60)],
    'diamond': [(-87, 24, 50), (-46, 24, 91),(-87, 24, 132),(-128, 24, 91)],
    'emerald': [(-96, 23, 82), (-78, 23, 82), (-78, 23, 100), (-96, 23, 100)]
}

# 商店NPC坐标
shopPos = {
    # 跟上面的格式一样
    # 物品商店
    'items': [(-124, 24, 14), (-62, 24, 14), (-10, 24, 54), (-10, 24, 116), (-50, 24, 169), (-112, 24, 160), (-164, 24, 128), (-164, 24, 66)],
    # 队伍升级商店
    'upgrades': [(80, 66, -6), (6, 66, 80),(-6, 66, -80),(-80, 66, 6)]
}

# 不同物品的价值（经验模式）
resValue = {
    'iron_ingot': 5,
    'gold_ingot': 100,
    'diamond': 500,
    'emerald': 1000
}

# =====================================================================
# 反装压设置
# 各种盔甲需要多长时间的计时？（名称需要和bwsScript.consts匹配）
armorTimers = {
    'iron': 420,
    'diamond_half': 360,
    'diamond': 175
}

# =============================常量定义区域，请勿修改=================================
bedHeading = {
    1: 4,
    2: 3,
    3: 2,
    4: 1,
    5: 3,
    6: 1,
    7: 4,
    8: 2
}
