# -*- coding: utf-8 -*-
# 请不要删掉上面这行！！！

# ICE_GAME 起床战争（经验模式）配置文档
# v1.1
# 新增 大厅等待人数
# ################################

# 全局坐标设置
# 等候大厅的坐标
lobbyPos = (500, 237, 500)
# 玩家淘汰后的重生位置
spectatorPos = (0, 233, 0)
# 多少人后会开始倒计时？
startCountdown = 2
# 多少人后会缩短倒计时
enoughPlayers = 14

# 队伍设置
# 使用数字index，1234分别为红黄蓝绿

# 设置队名（将在各种信息中显示）
teamNames = {
    1: '§c§l红队§r',
    2: '§e§l黄队§r',
    3: '§b§l蓝队§r',
    4: '§a§l绿队§r'
}

# 羊毛颜色
colorData = {
    1: 14,
    2: 4,
    3: 3,
    4: 5
}

# 队伍简称（出现在玩家头顶)
teamPrefix = {
    1: '§c§lR§r',
    2: '§e§lY§r',
    3: '§b§lB§r',
    4: '§a§lG§r'
}

# 总队伍数量
teamsCount = 4

# 队伍出生点
pos = {
    1: (-119, 160, 0), #red team
    2: (0, 160, -119), #yellow team
    3: (119, 160, 0), #blue team
    4: (0, 160, 119), #green team
}

# 队伍床坐标
bedPos = {
    1: (-108, 160, 0),
    2: (0, 160, -108),
    3: (108, 160, 0),
    4: (0, 160, 108),
}

# 床的偏移坐标（每个床占两个坐标）
bedPosD = {
    1: (-107, 160, 0),
    2: (0, 160, -107),
    3: (107, 160, 0),
    4: (0, 160, 107),
}

# 资源点坐标
resPos = {
    # 坐标用逗号间隔，不要去掉中括号！！！
    'iron': [(-120, 160, 0), (120, 160, 0), (0, 160, 120), (0, 160, -120)],
    'gold': [(-80, 158, -80), (-80, 158, 80), (80, 158, -80), (80, 158, 80)],
    'diamond': [(0, 220, -47), (0, 220, 47), (47, 220, 0), (-47, 220, 0)],
    'emerald': [(0, 219, -25), (0, 219, 25), (25, 219, 0), (-25, 219, 0)]
}

# 商店NPC坐标
shopPos = {
    # 跟上面的格式一样
    # 物品商店
    'items': [(-126, 160, 0), (126, 160, 0), (0, 160, 126), (0, 160, -126)],
    # 队伍升级商店
    'upgrades': [(80, 66, -6), (6, 66, 80), (-6, 66, -80), (-80, 66, 6)]
}

# 不同物品的价值（经验模式）
resValue = {
    'iron_ingot': 5,
    'gold_ingot': 100,
    'diamond': 500,
    'emerald': 1000
}

# =====================================================================
# 反装压设置
# 各种盔甲需要多长时间的计时？（名称需要和bwsScript.consts匹配）
armorTimers = {
    'iron': 420,
    'diamond_half': 360,
    'diamond': 175
}

# =============================常量定义区域，请勿修改=================================
bedHeading = {
    1: 1,
    2: 2,
    3: 3,
    4: 4,
}

# ===================================漂浮坐标=======================================
levitationPos = [(0, 164, 0)]       #给予玩家5s的漂浮lv.12效果

