# -*- coding: utf-8 -*-
labels = {
    1: "§cAdmin",
    2: "§6Mod",
    3: "§eHelper",
    4: "§bPVPSTAR",
    5: "§l§a两年老兵",
    6: "§l§6户籍大神",
    7: "§3§lICEGAME回归",
    8: "§e§l金腰带持有者",
    9: "§d§lDesuDesu",
    10: "§c§lApollo§f驱动",
    11: "§l§e自信§6满满",
    12: "§l§c所向§6披靡",
    13: "§l§d正义使者",
    14: "§l§c逃过一劫",
    15: "§l§4冷血§c杀手",
    16: "§d__TY__",
    17: '§l§o§aD§be§eb§cu',
    18: '§a爹爹',
    19: '§c§l服主',
    20: "§l§eGood §6Game",
    21: "§l§e纪狗，气死我了",
    22: "§l§5_ESU_",
    23: "§l§5公主",
    24: "§l§3拉胯",
    25: "§l§f就怕掉虚空",
    26: "§l§5I§cLOVE§bICE",
    27: "§l§b带§c主§a播",
    28: "§l§c◇乱杀◇",
    29: "§l§a时间多的离谱",
    30: "§lTimer",
    31: "§o§l§a肝§e帝",
    32: "§c§o§lHa§epp§by！",
    33: "§dOU§l§6欧§r§dOU",
    34: "§l§o§cS§6u§er§ap§3r§bi§ds§4e§f！",
    35: "§l§o§c.一发入魂.",
    38: "§dOSU!",
    39: "§f§l宝藏男孩",
    40: "§e§l技术支持§b>",
    41: "§l§c最佳辩手",
    42: "§l§6FFA6月榜一",
    43: "§l§4UP§c主",
    44: "§l§eICE_GAME§6Combo冲榜赛§c获胜者",
    45: "§l§aFFA7月榜一",
    46: "§l§2FFA8月榜一",
    47: "§l§c宇§6宙§e起§a床§b大§d王",
    48: "§l§aFFA9月榜一",
    49: "§l§6万圣节§8狂欢",
    50: "§l§c2022§f元旦庆典"
}

vipChatPrefix = {

}

prohibitedLabels = [1, 2, 3, 6, 7, 8, 11, 12, 13, 14, 16, 17, 19, 28, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50]

replaceWords = """欢呼! L EZ ez l
头号玩家 L子
猫 狗
貓 苟
先生 大佐
能力 户子 户籍 户口本 教科书
维护正义 神权 重拳出击
愉悦 爆笑如雷 开怀大笑
真是开心的一天 笑死了 笑死我了 xswl xsl 笑飞了
有待提高 垃圾 了色
跳舞 卡
翩翩起舞了 卡死了
深思熟虑 意淫
讷 呃 额 e
技术 装压
战术领先 偷刀
战术回血 喷药
单身十年 连点器 连点
战胜 畏惧"""