# -*- coding: utf-8 -*-
# 请不要删掉上面这行！！！

# ICE_GAME 空岛战争 通用 配置文档
# v1.1
# ################################

# 全局坐标设置
# 等候大厅的坐标
lobbyPos = (10000, 202, 10000)
# 玩家淘汰后的重生位置
spectatorPos = (10000, 100, 10000)
# 多少人后会开始倒计时？
startCountdown = 2
# 最多允许几个队？
teamsCount = 12
# 每队几个人？
maxPerTeam = 1

# 游戏场地设置
# 场地重置原理：系统会将指定坐标的场地模型直接clone到指定位置。该场地中需要包括玻璃准备室。

# 场地模板坐标1
templateP1 = (60, 59, 60)
# 场地模板坐标2
templateP2 = (-60, 35, -60)
# 目标地点的最低坐标
arenaPos = (9400, 35, 9400)

# 玩家出生点设置
# 只需写出玩家出生点即可，系统会根据出生点自动消除玻璃准备室
spawnPos = {
    1: (54, 57, 0),
    2: (-54, 57, 0),
    3: (0, 57, 54),
    4: (0, 57, -54),
    5: (-17, 57, 30),
    6: (14, 57, -30),
    7: (17, 57, 30),
    8: (-14, 57, -30),
    9: (-30, 57, 17),
    10: (30, 57, -17),
    11: (30, 57, 17),
    12: (-30, 57, -17)
}

# 箱子坐标
# 一共有3种等级的资源箱

# 每个出生岛有3个箱子。一个出生岛的箱子写在一行里，用逗号分开。（一级）
tier1Pos = [
    (-51, 51, 0), (-51, 49, 6), (-51, 49, -6),
    (51, 51, 0), (51, 49, 6), (51, 49, -6),
    (0, 51, 51), (-6, 49, 51), (6, 49, 51),
    (0, 51, -51), (-6, 49, -51), (6, 49, -51),
    (-11, 51, -30), (-11, 49, -24), (-11, 49, -36),
    (-11, 51, -30), (-11, 49, -24), (-11, 49, -36),
    (11, 51, -30), (11, 49, -24), (11, 49, -36),
    (30, 51, -14), (24, 49, -14), (36, 49, -14),
    (30, 51, 14), (24, 49, 14), (36, 49, 14),
    (14, 51, 30), (14, 49, 24), (14, 49, 36),
    (-14, 51, 30), (-14, 49, 24), (-14, 49, 36),
    (-30, 51, 14), (-24, 49, 14), (-36, 49, 14),
    (-30, 51, -14), (-24, 49, -14), (-36, 49, -14),
    (-30, 51, -14), (-24, 49, -14), (-36, 49, -14)
]

# 副岛的箱子（二级），写在一行里，逗号分开
tier2Pos = [
    (15, 49, 0), (-15, 49, 1), (0, 49, 15), (0, 49, -15)
]

# 中心岛的箱子（三级）
tier3Pos = [
    (4, 49, 0), (-4, 49, 1), (0, 49, 4), (0, 49, -4)
]

# =========================================== #

chestContents = [
    # tier 1
    {
        'leather_chestplate 1': 90,
        'iron_chestplate 1': 40,
        'iron_leggings 1': 60,
        'gold_helmet 1': 90,
        'leather_boots 1': 90,
        'iron_helmet 1': 20,

        'stone 32': 90,
        'wood 16': 100,
        'wood 48': 30,

        'stone_sword 1': 90,
        'iron_sword 1': 20
    },
    # tier 2
    {
        'golden_apple 1': 100,
        'golden_apple 3': 60,
        'experience_bottle 16': 100,
        'experience_bottle 32': 30,
        'iron_sword 1 17-3/9-1': 40,
        'stone_sword 1 17-3/9-3': 40,
        'ender_pearl 1': 100,
        'ender_pearl 3': 20,
        'water_bucket 1': 100,
        'diamond_chestplate 1': 25,
        'diamond_leggings 1': 60
    },
    # tier 3
    {
        'golden_apple 4': 100,
        'enchanted_golden_apple 1': 40,
        'ender_pearl 2': 100,
        'diamond_sword 1 17-3/9-2/13-1': 45,
        'diamond_sword 1 17-3/9-3': 45,
        'diamond_sword 1 9-5': 5,
        'dimaond_chestplate 1 17-3/0-2': 90,
        'dimaond_chestplate 1 17-3/0-3/5-2': 25,
        'diamond_helmet 1': 60,
        'diamond_boots 1': 60
    }
]
