# -*- coding: utf-8 -*-
# 请不要删掉上面这行！！！

# ICE_GAME速建 配置文档
# v1.1
# 新增 大厅等待人数
# ################################

# 全局坐标设置
# 等候大厅的坐标
lobbyPos = (0, 4, 0)
# 多少人后会开始倒计时？
startCountdown = 2
# 多少人后会缩短倒计时
enoughPlayers = 4

# 主题
themes = "冰淇淋 神社 超级马里奥 BiliBili 土豆 孙笑川 可乐 西瓜 汉堡 恐龙 沙鹰 女巫 寺庙 一铲 蔬菜 鱼总 扫帚 方舟 Phigros 地球 宇航服 鲨鱼 柯基 青蛙 游戏 黄昏 龙 胡泊 方块 marenol 柠檬 宝石 键盘 头盔 稻田 东京 东京奥运会 田所浩二 乒乓 土豆泥 冬天 Rickroll 二次元 足球 篮球 博物馆 床 JK 魔法 少女 村民 速度 电视 和平精英 箱子 显示屏 音游 耳机 蝴蝶 领带 土星 火 爆炸 世博会 黄河 TNT 2B2T 音响 猫娘 仓鼠 眼睛 烤面包 古埃及 金字塔 精灵村 比萨斜塔 橘子 粘土山 红色 雨林 音乐盒 花 螃蟹 猪肘子 机器人 SCP049 信息时代 钻石剑 大别墅 水晶 订书机 百科全书 魔方 电脑主机 熊 二哈 帐篷 曲率飞船 母亲 海岛 闹钟 冰箱 文件夹 竹 DokiDokiLiteratureClub 转盘 风景 教室 长江 归零者 伊藤美成 鸵鸟 蛋 雪碧 手表 摩斯电码 长号 龙王的工作 鲍勃 明日方舟 警告标识 手摇发电机 jvav 地铁 锅 前辈 椅子 猫耳女仆 精灵 尼尔机械纪元 滑稽 我妻由乃 主播 必胜 冬奥会 游泳 举重 京剧 电影院 牙签 忍耐 干员 博士 欣喜若狂 深思熟虑 整活 翩翩起舞 动不了 欢呼 猫 先生 外婆 阿米娅 血小板 白细胞 指令 商店 你和驴 观战 死亡 分歧者 管理员 服主 大呲牙 西瓜 流汗 无语 黄豆 火腿 兰博基尼 饼干 阿婆 公交车 跑酷 话筒 天堂 晚霞".split()